{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7dbb3f10",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "import os\n",
    "\n",
    "load_dotenv()\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USER = os.getenv(\"NEO4J_USER\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "eec2cd8b",
   "metadata": {},
   "source": [
    "## Build Graph Communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "4b3538e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "# project graph\n",
    "\n",
    "gds = GraphDataScience(\n",
    "    os.environ[\"NEO4J_URI\"],\n",
    "    auth=(os.environ[\"NEO4J_USER\"], os.environ[\"NEO4J_PASSWORD\"])\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "0d6fd858",
   "metadata": {},
   "outputs": [],
   "source": [
    "from graphdatascience import GraphDataScience\n",
    "\n",
    "G, result = gds.graph.project(\n",
    "    \"communities\",  #  Graph name\n",
    "    \"*\",  #  Node projection\n",
    "    {\n",
    "        \"_ALL_\": {\n",
    "            \"type\": \"*\",\n",
    "            \"orientation\": \"UNDIRECTED\",\n",
    "            \"properties\": {\"weight\": {\"property\": \"*\", \"aggregation\": \"COUNT\"}},\n",
    "        }\n",
    "    },\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba36ce52",
   "metadata": {},
   "source": [
    "The authors employed the Leiden algorithm, a hierarchical clustering method, to identify communities within the graph. One advantage of using a hierarchical community detection algorithm is the ability to examine communities at multiple levels of granularity. The authors suggest summarizing all communities at each level, providing a comprehensive understanding of the graph’s structure.\n",
    "\n",
    "First, we will use the Weakly Connected Components (WCC) algorithm to assess the connectivity of our graph. This algorithm identifies isolated sections within the graph, meaning it detects subsets of nodes or components that are connected to each other but not to the rest of the graph. These components help us understand the fragmentation within the network and identify groups of nodes that are independent from others. WCC is vital for analyzing the overall structure and connectivity of the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "ee1677b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Component count: 60\n",
      "Component distribution: {'min': 6, 'p5': 6, 'max': 166178, 'p999': 166178, 'p99': 166178, 'p1': 6, 'p10': 6, 'p90': 15, 'p50': 8, 'p25': 6, 'p75': 12, 'p95': 16, 'mean': 2779.016666666667}\n"
     ]
    }
   ],
   "source": [
    "wcc = gds.wcc.stats(G)\n",
    "print(f\"Component count: {wcc['componentCount']}\")\n",
    "print(f\"Component distribution: {wcc['componentDistribution']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6b3cc783",
   "metadata": {},
   "source": [
    "Next, we will run the Leiden algorithm, which is also available in the GDS library, and enable the includeIntermediateCommunities parameter to return and store communities at all levels. We have also included a relationshipWeightProperty parameter to run the weighted variant of the Leiden algorithm. Using the write mode of the algorithm stores the results as a node property."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "175572f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "ranLevels                                                                6\n",
       "didConverge                                                           True\n",
       "nodeCount                                                           166741\n",
       "communityCount                                                         249\n",
       "preProcessingMillis                                                      3\n",
       "computeMillis                                                          457\n",
       "postProcessingMillis                                                     4\n",
       "writeMillis                                                            798\n",
       "nodePropertiesWritten                                               166741\n",
       "communityDistribution    {'min': 6, 'p5': 6, 'max': 5579, 'p999': 5579,...\n",
       "modularities             [0.5811948831561885, 0.7638721701592919, 0.814...\n",
       "modularity                                                        0.826609\n",
       "configuration            {'writeProperty': 'communities', 'theta': 0.01...\n",
       "Name: 0, dtype: object"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "gds.leiden.write(\n",
    "    G,\n",
    "    writeProperty=\"communities\",\n",
    "    includeIntermediateCommunities=True,\n",
    "    relationshipWeightProperty=\"weight\",\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de2123b5",
   "metadata": {},
   "source": [
    "Now, we create a distinct node for each community and represent their hierarchical structure as an interconnected graph. Later, we will also store community summaries and other attributes as node properties."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "bf90d0ee",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"CREATE CONSTRAINT IF NOT EXISTS FOR (c:__Community__) REQUIRE c.id IS UNIQUE;\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "7f6988ab",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(*)': 1000446}]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (e)\n",
    "UNWIND range(0, size(e.communities) - 1 , 1) AS index\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index = 0\n",
    "  MERGE (c:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET c.level = index\n",
    "  MERGE (e)-[:IN_COMMUNITY]->(c)\n",
    "  RETURN count(*) AS count_0\n",
    "}\n",
    "CALL {\n",
    "  WITH e, index\n",
    "  WITH e, index\n",
    "  WHERE index > 0\n",
    "  MERGE (current:`__Community__` {id: toString(index) + '-' + toString(e.communities[index])})\n",
    "  ON CREATE SET current.level = index\n",
    "  MERGE (previous:`__Community__` {id: toString(index - 1) + '-' + toString(e.communities[index - 1])})\n",
    "  ON CREATE SET previous.level = index - 1\n",
    "  MERGE (previous)-[:IN_COMMUNITY]->(current)\n",
    "  RETURN count(*) AS count_1\n",
    "}\n",
    "RETURN count(*)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a1dd9295",
   "metadata": {},
   "source": [
    "The authors also introduce a community rank, indicating the number of distinct text chunks in which the entities within the community appear:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "725c70a6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 48,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "MATCH (c:__Community__)<-[:IN_COMMUNITY*]-(:__Entity__)<-[:MENTIONS]-(d:Document)\n",
    "WITH c, count(distinct d) AS rank\n",
    "SET c.community_rank = rank;\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "13a0b72c",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USER,\n",
    "    password=NEO4J_PASSWORD\n",
    ")\n",
    "\n",
    "community_info = graph.query(\"\"\"\n",
    "MATCH (c:`__Community__`)<-[:IN_COMMUNITY*]-(n)\n",
    "WHERE c.level IN [0,1,4]\n",
    "WITH c, collect(n) AS nodes\n",
    "WHERE size(nodes) > 1\n",
    "CALL apoc.path.subgraphAll(nodes[0], {\n",
    "    whitelistNodes: nodes\n",
    "})\n",
    "YIELD relationships\n",
    "RETURN c.id AS communityId,\n",
    "       [node IN nodes | {id: node.id, description: node.description, type: head(labels(node))}] AS nodes,\n",
    "       [r IN relationships | {start: startNode(r).id, type: type(r), end: endNode(r).id, description: r.description}] AS rels\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "93303992",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'communityId': '0-97068',\n",
       " 'nodes': [{'id': None, 'description': None, 'type': 'MOF'},\n",
       "  {'id': None, 'description': None, 'type': 'Paper'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Precursor'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Property'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Property'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Property'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'},\n",
       "  {'id': None, 'description': None, 'type': 'Text'}],\n",
       " 'rels': [{'start': None,\n",
       "   'description': None,\n",
       "   'type': 'HAS_SOURCE',\n",
       "   'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_PROPERTY', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_PROPERTY', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_PROPERTY', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'SYNTHESIZED_IN', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'USES', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'SUPPORTS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'SUPPORTS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'SUPPORTS', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'HAS_SOURCE', 'end': None},\n",
       "  {'start': None, 'description': None, 'type': 'MENTIONS', 'end': None}]}"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "community_info[5000]"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1d8a0fd7",
   "metadata": {},
   "source": [
    "## Generate Community Summaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "cf4bacef",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "API Key: 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\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "print(\"API Key:\", os.getenv(\"OPENAI_API_KEY\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "7558b477",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_openai import ChatOpenAI\n",
    "\n",
    "\n",
    "llm = ChatOpenAI(temperature=0, model_name=\"gpt-5-mini\")\n",
    "\n",
    "\n",
    "community_template = \"\"\"Based on the provided nodes and relationships that belong to the same graph community,\n",
    "generate a natural language summary of the provided information:\n",
    "{community_info}\n",
    "\n",
    "Summary:\"\"\"  # noqa: E501\n",
    "\n",
    "community_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            \"Given an input triples, generate the information summary. No pre-amble.\",\n",
    "        ),\n",
    "        (\"human\", community_template),\n",
    "    ]\n",
    ")\n",
    "\n",
    "community_chain = community_prompt | llm | StrOutputParser()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "cb87a436",
   "metadata": {},
   "outputs": [],
   "source": [
    "def prepare_string(data):\n",
    "    nodes_str = \"Nodes are:\\n\"\n",
    "    for node in data['nodes']:\n",
    "        node_id = node['id']\n",
    "        node_type = node['type']\n",
    "        if 'description' in node and node['description']:\n",
    "            node_description = f\", description: {node['description']}\"\n",
    "        else:\n",
    "            node_description = \"\"\n",
    "        nodes_str += f\"id: {node_id}, type: {node_type}{node_description}\\n\"\n",
    "\n",
    "    rels_str = \"Relationships are:\\n\"\n",
    "    for rel in data['rels']:\n",
    "        start = rel['start']\n",
    "        end = rel['end']\n",
    "        rel_type = rel['type']\n",
    "        if 'description' in rel and rel['description']:\n",
    "            description = f\", description: {rel['description']}\"\n",
    "        else:\n",
    "            description = \"\"\n",
    "        rels_str += f\"({start})-[:{rel_type}]->({end}){description}\\n\"\n",
    "\n",
    "    return nodes_str + \"\\n\" + rels_str\n",
    "\n",
    "def process_community(community):\n",
    "    stringify_info = prepare_string(community)\n",
    "    summary = community_chain.invoke({'community_info': stringify_info})\n",
    "    return {\"community\": community['communityId'], \"summary\": summary}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "0cc3ccdf",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Processing communities: 0it [00:00, ?it/s]\n"
     ]
    }
   ],
   "source": [
    "from concurrent.futures import ThreadPoolExecutor, as_completed\n",
    "from tqdm import tqdm\n",
    "\n",
    "summaries = []\n",
    "limited_communities = community_info[:15]\n",
    "with ThreadPoolExecutor() as executor:\n",
    "    futures = {executor.submit(process_community, community): community for community in limited_communities}\n",
    "\n",
    "    for future in tqdm(as_completed(futures), total=len(futures), desc=\"Processing communities\"):\n",
    "        summaries.append(future.result())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "be93716b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "summaries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ec7ed185",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "hackathon",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
